InformationRegisters/бит_НастройкаОтчетаГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкаОтчетаГЦЖС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПолеДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяПоляExcel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФорматКолонки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоляExcel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_НастройкаОтчетаГЦЖС/Ext/ManagerModule.bsl
Процедура ПроверитьЗаполнениеРегистра () Экспорт
	
 НаборЗаписей = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьНаборЗаписей();
 НаборЗаписей.Прочитать();
 
 если НаборЗаписей.Количество() = 0 тогда
	ЗаполнениеПоУмолчанию();
 конецесли;	 
	
КонецПроцедуры	

Процедура ЗаполнениеПоУмолчанию () Экспорт
	   
  НаборЗаписей = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьНаборЗаписей();
  НаборЗаписей.Записать();	
	
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 1;
  Запись.ИмяПоляExcel = "KODORG";
  Запись.ПолеДанных = "КодОрганизации";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 2;
  Запись.ИмяПоляExcel = "NAZVORG";
  Запись.ПолеДанных = "Организация";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 3;
  Запись.ИмяПоляExcel = "GOD";
  Запись.ПолеДанных = "Год";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 4;
  Запись.ИмяПоляExcel = "MES";
  Запись.ПолеДанных = "Месяц";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 5;
  Запись.ПолеДанных = "НомерЛС";
  Запись.ИмяПоляExcel = "NUMLS";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 6;
  Запись.ИмяПоляExcel = "SOB";  
  Запись.ПолеДанных = "ОбщаяПлощадь";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 7;
  Запись.ИмяПоляExcel = "TIPZF"; 
  Запись.ПолеДанных = "ТипЖилищногоФонда";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 8;
  Запись.ИмяПоляExcel = "KOLCHLS";
  Запись.ПолеДанных = "КолвоЗарегистрированных";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 9;
  Запись.ИмяПоляExcel = "TARIFTO";
  Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаТОПоОбщейПлощади";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 10;
  Запись.ИмяПоляExcel = "TARIFKR";
  Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаКапРемонт";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 11;
  Запись.ИмяПоляExcel = "TARIFTO2";
  Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаТОПоПроживающим";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 12;
  Запись.ИмяПоляExcel = "TARIFOTOP";
  Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаОтопление";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 13;
  Запись.ИмяПоляExcel = "TARIFHV";
  Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаХолВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 14;
  Запись.ИмяПоляExcel = "TARIFGV";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина); 
 
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 15;
  Запись.ИмяПоляExcel = "TARGV_VD";
  Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаХолВодаДляГВС";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 16;
  Запись.ИмяПоляExcel = "TARGV_PG";
  Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаГорВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 17;
  Запись.ИмяПоляExcel = "TARIFSTOKI";
  Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаВодоотвод";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 18;
  Запись.ИмяПоляExcel = "TARIFGAZ";
  Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаГаз";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 19;
  Запись.ИмяПоляExcel = "TARIFEE";
  Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаЭлектроэнергия";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 20;
  Запись.ИмяПоляExcel = "TARTKO";
  Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаБытОтходы";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 21;
  Запись.ИмяПоляExcel = "TAR_ODNGV";
  //Запись.ПолеДанных = "ВЫГРУЗКА_ТОПоОбщейПлощади";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 22;
  Запись.ИмяПоляExcel = "TAR_ODNHV";
  //Запись.ПолеДанных = "ВЫГРУЗКА_КапРемонт";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 23;
  Запись.ИмяПоляExcel = "TARIFOEL";
  //Запись.ПолеДанных = "ВЫГРУЗКА_ТОПоОбщейПлощади";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 24;
  Запись.ИмяПоляExcel = "SUMTO";
  Запись.ПолеДанных = "ВЫГРУЗКА_ТОПоОбщейПлощади";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 25;
  Запись.ИмяПоляExcel = "SUMKR";
  Запись.ПолеДанных = "ВЫГРУЗКА_ОтоплениеОбщедомовое";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 26;
  Запись.ИмяПоляExcel = "SUMTO2";
  Запись.ПолеДанных = "ВЫГРУЗКА_ТОПоПроживающим";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 27;
  Запись.ИмяПоляExcel = "SUMOTOP";
  Запись.ПолеДанных = "ВЫГРУЗКА_ОтоплениеОбщедомовое";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 28;
  Запись.ИмяПоляExcel = "SUMHV";
  Запись.ПолеДанных = "ВЫГРУЗКА_ХолВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 29;
  Запись.ИмяПоляExcel = "SUMGV";
//  Запись.ПолеДанных = "ВЫГРУЗКА_ХолВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);  
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 30;
  Запись.ИмяПоляExcel = "SUMGV_VD";
  Запись.ПолеДанных = "ВЫГРУЗКА_ХолВодаДляГВС";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 31;
  Запись.ИмяПоляExcel = "SUMGV_PG";
  Запись.ПолеДанных = "ВЫГРУЗКА_ГорВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 32;
  Запись.ИмяПоляExcel = "SUMSTOKI";
  Запись.ПолеДанных = "ВЫГРУЗКА_Водоотвод";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 33;
  Запись.ИмяПоляExcel = "SUMGAZ";
  Запись.ПолеДанных = "ВЫГРУЗКА_Газ";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 34;
  Запись.ИмяПоляExcel = "SUMEE";
  Запись.ПолеДанных = "ВЫГРУЗКА_Электроэнергия";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 35;
  Запись.ИмяПоляExcel = "SUMTKO";
  Запись.ПолеДанных = "ВЫГРУЗКА_БытОтходы";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 36;
  Запись.ИмяПоляExcel = "SUMODNGV";
  Запись.ПолеДанных = "ВЫГРУЗКА_СЧ_ХолВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 37;
  Запись.ИмяПоляExcel = "SUMODNHV";
  Запись.ПолеДанных = "ВЫГРУЗКА_СЧ_ГорВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 38;
  Запись.ИмяПоляExcel = "SUMOEL";
  Запись.ПолеДанных = "ВЫГРУЗКА_СЧ_Водоотвод";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 39;
  Запись.ИмяПоляExcel = "SCHHV";
  Запись.ПолеДанных = "ВЫГРУЗКА_НормаХолВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 40;
  Запись.ИмяПоляExcel = "SCHGV";
  //Запись.ПолеДанных = "ВЫГРУЗКА_НормаХолВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 41;
  Запись.ИмяПоляExcel = "SCHGV_VD";
  Запись.ПолеДанных = "ВЫГРУЗКА_СЧ_ХолВодаДляГВС";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 42;
  Запись.ИмяПоляExcel = "SCHGV_PG";
  Запись.ПолеДанных = "ВЫГРУЗКА_СЧ_ГорВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 43;
  Запись.ИмяПоляExcel = "SCHSTOKI";
  Запись.ПолеДанных = "ВЫГРУЗКА_СЧ_Водоотвод";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 44;
  Запись.ИмяПоляExcel = "SCHGAZ";
  Запись.ПолеДанных = "ВЫГРУЗКА_СЧ_Газ";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 45;
  Запись.ИмяПоляExcel = "NORMHV";
  Запись.ПолеДанных = "ВЫГРУЗКА_НормаХолВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 46;
  Запись.ИмяПоляExcel = "NORMGV";
//  Запись.ПолеДанных = "ВЫГРУЗКА_НормаГаз";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 47;
  Запись.ИмяПоляExcel = "NORMGV_VD";
  Запись.ПолеДанных = "ВЫГРУЗКА_НормаХолВодаДляГВС";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 48;
  Запись.ИмяПоляExcel = "NORMGV_PG";
  Запись.ПолеДанных = "ВЫГРУЗКА_НормаГорВода";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 49;
  Запись.ИмяПоляExcel = "NORMSTOKI";
  Запись.ПолеДанных = "ВЫГРУЗКА_НормаВодоотвод";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 50;
  Запись.ИмяПоляExcel = "NORMGAZ";
  Запись.ПолеДанных = "ВЫГРУЗКА_НормаГаз";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);         
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 51;
  Запись.ИмяПоляExcel = "NORMEE";
  Запись.ПолеДанных = "ВЫГРУЗКА_НормаЭлектроэнергия";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 52;
  Запись.ИмяПоляExcel = "NORMTKO";
  Запись.ПолеДанных = "ВЫГРУЗКА_НормаБытОтходы";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 53;
  Запись.ИмяПоляExcel = "NORM_OGV";
//  Запись.ПолеДанных = "КодПлиты";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 54;
  Запись.ИмяПоляExcel = "NORM_OHV";
//  Запись.ПолеДанных = "КодПлиты";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 55;
  Запись.ИмяПоляExcel = "NORMOEL";
//  Запись.ПолеДанных = "КодПлиты";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);    

  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 56;
  Запись.ИмяПоляExcel = "KOLTKO";
//  Запись.ПолеДанных = "КодПлиты";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 57;
  Запись.ИмяПоляExcel = "KODPLITA";
  Запись.ПолеДанных = "КодПлиты";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 58;
  Запись.ИмяПоляExcel = "KOLFML";
  Запись.ПолеДанных = "КоличествоСемей";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 59;
  Запись.ИмяПоляExcel = "FIO";
  Запись.ПолеДанных = "ФИО";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 60;
  Запись.ИмяПоляExcel = "ADRES";
  Запись.ПолеДанных = "АдресЛС";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 61;
  Запись.ИмяПоляExcel = "NUMROOM";
  Запись.ПолеДанных = "КоличествоКомнат";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 62;
  Запись.ИмяПоляExcel = "NUMFLOOR";
  Запись.ПолеДанных = "Этаж";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 63;
  Запись.ИмяПоляExcel = "DOLG";
  Запись.ПолеДанных = "СуммаЗадолженности";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);
  
  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 64;
  Запись.ИмяПоляExcel = "KNOTKU";
  Запись.ПолеДанных = "КолвоНеПроживающих";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  Запись.НомерПоляExcel = 65;
  Запись.ИмяПоляExcel = "KODTIPZF";
  Запись.ПолеДанных = "КодТипЖилья";
  Запись.Период = НачалоДня(ТекущаяДата());
  Запись.Записать(истина);

  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 66;
  //Запись.ИмяПоляExcel = "VODONAGR";
  //Запись.ПолеДанных = "Водонагреватель";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);
  //
  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 67;
  //Запись.ИмяПоляExcel = "GAZOTOP";
  //Запись.ПолеДанных = "ОтоплениеГазом";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);
  //
  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 68;
  //Запись.ИмяПоляExcel = "CENTRGV";
  //Запись.ПолеДанных = "ЦентральноеГорячееВодоснабжение";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);

  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 69;
  //Запись.ИмяПоляExcel = "KOMNAT";
  //Запись.ПолеДанных = "КоличествоКомнат";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);   
  //
  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 70;
  //Запись.ИмяПоляExcel = "NAEE_O";
  //Запись.ПолеДанных = "ВЫГРУЗКА_ЭлектроэнергияОДН";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);

  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 71;
  //Запись.ИмяПоляExcel = "TARIFEE_O";
  //Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаЭлектроэнергияОДН";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);

  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 72;
  //Запись.ИмяПоляExcel = "NAHV_O";
  //Запись.ПолеДанных = "ВЫГРУЗКА_ХолВодаОДН";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);

  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 73;
  //Запись.ИмяПоляExcel = "TARIFHV_O";
  //Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаХолВодаОДН";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);
  //
  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 74;
  //Запись.ИмяПоляExcel = "NAGV_O";
  //Запись.ПолеДанных = "ВЫГРУЗКА_ХВСдляГВСОДН";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);

  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 75;
  //Запись.ИмяПоляExcel = "TARIFGV_O";
  //Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаХВСдляГВСОДН";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);

  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 76;
  //Запись.ИмяПоляExcel = "NASTOK_O";
  //Запись.ПолеДанных = "ВЫГРУЗКА_ВодоотводОДН";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);
  //
  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 77;
  //Запись.ИмяПоляExcel = "TARIFSTOK_O";
  //Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаВодоотводОДН";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);
  //
  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 78;
  //Запись.ИмяПоляExcel = "NAGV_PGO";
  //Запись.ПолеДанных = "ВЫГРУЗКА_ПодогревОДН";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);
  //
  //Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
  //Запись.НомерПоляExcel = 79;
  //Запись.ИмяПоляExcel = "TARGV_PGO";
  //Запись.ПолеДанных = "ВЫГРУЗКА_СтавкаПодогревОДН";
  //Запись.Период = НачалоДня(ТекущаяДата());
  //Запись.Записать(истина);    

  ЗаполнитьФормат ();
//  РегистрыСведений.бит_ГрупповыеСчетчики
//	
//            Поле = "КодОрганизации";
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных[Поле] , 1 , НомерСтроки); 
////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КодОрганизации                 , 1 , НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Организация                    , 2 , НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Год                            , 3 , НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Месяц                          , 4 , НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.НомерЛС                        , 5 , НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ОбщаяПлощадь                   , 6 , НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ТипЖилищногоФонда              , 7 , НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КолвоЗарегистрированных        , 8 , НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаТОПоОбщейПлощади, 9 , НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаКапРемонт		, 10, НомерСтроки);
//			// БИТ ЖКХ 31.01.2020
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаТОПоПроживающим , 11, НомерСтроки);
//			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаОтопление       , 12, НомерСтроки);
//			// БИТ_ЖКХ 09.02.2016 15:30:30 Начало правки...
//						// БИТ_ЖКХ 09.02.2016 15:30:30 Конец правки.
////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаНайм            , 13, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаХолВода         , 13, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаГорВода         , 16, НомерСтроки);
//			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаВодоотвод       , 17, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаГаз             , 18, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаЭлектроэнергия  , 19, НомерСтроки);			
//			// БИТ_ЖКХ 29.01.2020
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаБытОтходы       , 20, НомерСтроки);					
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ТОПоОбщейПлощади      , 21, НомерСтроки);
//			// БИТ_ЖКХ 29.01.2020
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_КапРемонт				, 22, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ТОПоПроживающим       , 23, НомерСтроки);
//			// БИТ_ЖКХ 09.02.2016 15:30:36 Начало правки...
//						// БИТ_ЖКХ 09.02.2016 15:30:36 Конец правки.
//			//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Найм                  , 22, НомерСтроки);
//			// БИТ ЖКХ 26.11.2020
//			//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Отопление             , 22, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ОтоплениеОбщедомовое  , 24, НомерСтроки);
//						
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ХолВода               , 25, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ГорВода               , 30, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Водоотвод             , 31, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Газ                   , 32, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_Электроэнергия        , 33, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_БытОтходы             , 34, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_ХолВода            , 35, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_ГорВода            , 36, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_Водоотвод          , 37, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СЧ_Газ                , 38, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаХолВода          , 39, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаГорВода          , 47, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаВодоотвод        , 48, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаГаз              , 49, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаЭлектроэнергия   , 50, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_НормаБытОтходы        , 51, НомерСтроки);			
////			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_БытОтходы             , 39, НомерСтроки);	
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КодПлиты                       , 52, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоСемей                , 53, НомерСтроки);			
//			// БИТ_ЖКХ 27.05.2014
//			//бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоСемейГаз             , 42, НомерСтроки);
//			// БИТ_ЖКХ 27.05.2014
//			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ФИО                            , 54, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.АдресЛС                        , 55, НомерСтроки);			
//			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоКомнат               , 56, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Этаж                           , 57, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.СуммаЗадолженности             , 58, НомерСтроки);
//			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КолвоНеПроживающих             , 59, НомерСтроки);
//			
//			// БИТ_ЖКХ 27.05.2014
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КодТипЖилья                    , 60, НомерСтроки);
//			// БИТ_ЖКХ 27.20.2020
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.Водонагреватель                , 61, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ОтоплениеГазом                 , 62, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ЦентральноеГорячееВодоснабжение, 63, НомерСтроки);
//			// БИТ_ЖКХ 27.05.2014
//			
//			// БИТ_ЖКХ 1.04.2020{{			
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.КоличествоКомнат, 64, НомерСтроки);
//			// БИТ_ЖКХ 23.01.2015}}
//			
//			// БИТ_ЖКХ 15.05.2017 17:23:09 Начало правки...
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ЭлектроэнергияОДН			, 65, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаЭлектроэнергияОДН	, 66, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ХолВодаОДН				, 67, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаХолВодаОДН			, 68, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ХВСдляГВСОДН				, 69, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаХВСдляГВСОДН		, 70, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ВодоотводОДН				, 71, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаВодоотводОДН		, 72, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_ПодогревОДН				, 73, НомерСтроки);
//			бит_Выгрузка.УстановитьЗначениеЯчейкиExcel(ExcelЛист, , СтрокаДанных.ВЫГРУЗКА_СтавкаПодогревОДН			, 74, НомерСтроки);
//			// БИТ_ЖКХ 15.05.2017 17:23:09 Конец правки.
	
КонецПроцедуры	

функция УстановитьФормат(СтрокаФормата, КодСтроки)
	
 НаборЗаписей = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьНаборЗаписей();
 НаборЗаписей.Отбор.НомерПоляExcel.Установить(КодСтроки);	  
 НаборЗаписей.Прочитать();

 если НаборЗаписей.Количество() > 0 тогда
	 НаборЗаписей[0].ФорматКолонки = СтрокаФормата; 
	 НаборЗаписей.Записать();
 конецесли;
конецфункции	

Процедура ЗаполнитьФормат ()
	
	УстановитьФормат( "0"   , 1 );
	УстановитьФормат( "@"   , 2 );
	УстановитьФормат( "0"   , 3 );
	УстановитьФормат( "0"   , 4 );
	УстановитьФормат( "@"   , 5 );
	УстановитьФормат( "0,00", 6 );
	УстановитьФормат( "0"   , 7 );
	УстановитьФормат( "0"   , 8 );
	УстановитьФормат( "0,00", 9 );
	УстановитьФормат( "0,00", 10);
	УстановитьФормат( "0,00", 11);
	УстановитьФормат( "0,00", 12);
	УстановитьФормат( "0,00", 13);
	УстановитьФормат( "0,00", 14);
	УстановитьФормат( "0,00", 15);
	УстановитьФормат( "0,00", 16);
	УстановитьФормат( "0,00", 17);
	УстановитьФормат( "0,00", 18);
	УстановитьФормат( "0,00", 19);
	УстановитьФормат( "0,00", 20);
	УстановитьФормат( "0,00", 21);
	УстановитьФормат( "0,00", 22);
	УстановитьФормат( "0,00", 23);
	УстановитьФормат( "0,00", 24);
	УстановитьФормат( "0,00", 25);
	УстановитьФормат( "0,00", 26);
	УстановитьФормат( "0"   , 27);
	УстановитьФормат( "0,00", 28);
	УстановитьФормат( "0"   , 29);
	УстановитьФормат( "0"   , 30);
	УстановитьФормат( "0,00", 31);
	УстановитьФормат( "0,00", 32);
	УстановитьФормат( "0,00", 33);
	УстановитьФормат( "0,00", 34);
	УстановитьФормат( "0,00", 35);
	УстановитьФормат( "0"   , 36);
	УстановитьФормат( "0"   , 37);
	
	// БИТ_ЖКХ 15.05.2014
	УстановитьФормат( "0"   , 38);
	// БИТ_ЖКХ 15.05.2014
	
	УстановитьФормат( "@"   , 39);
	УстановитьФормат( "@"   , 40);
	УстановитьФормат( "0,00", 41);
	УстановитьФормат( "0"   , 42);
	
	// БИТ_ЖКХ 15.05.2014
	УстановитьФормат( "0"   , 39);
	УстановитьФормат( "0"   , 40);
	УстановитьФормат( "0"   , 41);
	УстановитьФормат( "0"   , 42);
	// БИТ_ЖКХ 15.05.2014
	
	// БИТ_ЖКХ 09.02.2016 15:08:55 Начало правки...
	УстановитьФормат( "0,00", 48);
	УстановитьФормат( "0,00", 49);
	// БИТ_ЖКХ 09.02.2016 15:08:55 Конец правки.
	
	// БИТ_ЖКХ 15.05.2017 16:49:07 Начало правки...
	УстановитьФормат( "0,00", 50);
	УстановитьФормат( "0,00", 51);
	УстановитьФормат( "0,00", 52);
	УстановитьФормат( "0,00", 53);
	УстановитьФормат( "0,00", 54);
	УстановитьФормат( "0,00", 55);
	УстановитьФормат( "0,00", 56);
	УстановитьФормат( "0,00", 57);
	УстановитьФормат( "0,00", 58);
	УстановитьФормат( "0,00", 59);

КонецПроцедуры	

Процедура ЗаписатьДанныеВФорматеXML(ПутьКФайлуДляЗаписи) Экспорт
	
	//ПутьКФайлуДляЗаписи = "D:\Разработка\ГЦЖС\НастрокаОтчетаГЦЖС.XML";
	
    НаборЗаписей = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьНаборЗаписей();		  
	НаборЗаписей.Прочитать();
	
	таблицаНабора = НаборЗаписей.Выгрузить();
	таблицаНабора.Сортировать("НомерПоляExcel");
 
    ЗаписьXML = Новый ЗаписьXML;
 
    ЗаписьXML.ОткрытьФайл(ПутьКФайлуДляЗаписи);
 
    ЗаписьXML.ЗаписатьОбъявлениеXML();    
 
    ЗаписьXML.ЗаписатьНачалоЭлемента("НастрокиОтчетаГЦЖС");
 
    Для Каждого строкаНастроек Из таблицаНабора Цикл
        ЗаписьXML.ЗаписатьНачалоЭлемента("Колонка");
		
        ЗаписьXML.ЗаписатьАтрибут("ИмяПоляExcel", строкаНастроек.ИмяПоляExcel);
        ЗаписьXML.ЗаписатьАтрибут("ФорматКолонки", строкаНастроек.ФорматКолонки);
        ЗаписьXML.ЗаписатьАтрибут("НомерПоляExcel", строка(строкаНастроек.НомерПоляExcel)); 
        ЗаписьXML.ЗаписатьАтрибут("ПолеДанных", строкаНастроек.ПолеДанных); 
        
        ЗаписьXML.ЗаписатьКонецЭлемента(); // Страна
    КонецЦикла;
 
    ЗаписьXML.ЗаписатьКонецЭлемента(); // Страны
 
    ЗаписьXML.Закрыть();
 
КонецПроцедуры

Процедура ПрочитатьДанныеВФорматеXML(ПутьКФайлу) Экспорт
	
	//ПутьКФайлу = "D:\Разработка\ГЦЖС\НастрокаОтчетаГЦЖС.XML";
	
    Парсер = Новый ЧтениеXML;
    Парсер.ОткрытьФайл(ПутьКФайлу);
	
	таблицаНабора = новый ТаблицаЗначений;
	таблицаНабора.Колонки.Добавить("ИмяПоляExcel");
	таблицаНабора.Колонки.Добавить("ФорматКолонки");
	таблицаНабора.Колонки.Добавить("НомерПоляExcel");//, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 3)));
	таблицаНабора.Колонки.Добавить("ПолеДанных");

	
	Пока Парсер.Прочитать() Цикл
	  если ЗначениеЗаполнено(Парсер.ЗначениеАтрибута("ИмяПоляExcel")) тогда	
		строкаНастроек = таблицаНабора.Добавить();
		строкаНастроек.ИмяПоляExcel = Парсер.ЗначениеАтрибута("ИмяПоляExcel");
		строкаНастроек.ФорматКолонки = Парсер.ЗначениеАтрибута("ФорматКолонки");
		строкаНастроек.НомерПоляExcel = Парсер.ЗначениеАтрибута("НомерПоляExcel");
		строкаНастроек.ПолеДанных = Парсер.ЗначениеАтрибута("ПолеДанных");
	  конецесли;	
      Парсер.Прочитать()	 
	конеццикла;
	
	Парсер.Закрыть();
	
	если таблицаНабора.Количество() > 0 тогда
	
	 НаборЗаписей = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьНаборЗаписей();
     НаборЗаписей.Записать();	
	 
	 для каждого стр из таблицаНабора цикл 
	 
	     Запись = РегистрыСведений.бит_НастройкаОтчетаГЦЖС.СоздатьМенеджерЗаписи();
	     Запись.НомерПоляExcel = стр.НомерПоляExcel;
	     Запись.ИмяПоляExcel = стр.ИмяПоляExcel;
		 Запись.ФорматКолонки = стр.ФорматКолонки;
	     Запись.ПолеДанных = стр.ПолеДанных;
	     Запись.Период = НачалоДня(ТекущаяДата());
	     Запись.Записать(истина);
	 
	 конеццикла;
	 
    конецесли;
 
КонецПроцедуры
